[
  {
    "id": "start",
    "text": "Oi! Para começar, qual é o nome da demanda ou projeto?",
    "next": "id_codigo"
  },
  {
    "id": "id_codigo",
    "text": "Existe algum código interno, chamado ou ticket relacionado a essa demanda? Se sim, qual?",
    "next": "id_solicitante"
  },
  {
    "id": "id_solicitante",
    "text": "Quem está trazendo essa necessidade? (nome, área, função)",
    "next": "ctx_motivacao"
  },
  {
    "id": "ctx_motivacao",
    "text": "O que motivou essa necessidade agora?",
    "next": "ctx_dor"
  },
  {
    "id": "ctx_dor",
    "text": "Qual é o principal problema ou dor que vocês querem resolver?",
    "next": "ctx_consequencia"
  },
  {
    "id": "ctx_consequencia",
    "text": "O que acontece hoje quando esse problema surge?",
    "next": "ctx_impactados"
  },
  {
    "id": "ctx_impactados",
    "text": "Quem são os principais impactados por esse problema? (usuários, áreas, clientes)",
    "next": "ctx_sem_acao"
  },
  {
    "id": "ctx_sem_acao",
    "text": "Se nada fosse feito sobre esse problema, o que você imagina que aconteceria em 6 a 12 meses?",
    "next": "obj_ideal"
  },
  {
    "id": "obj_ideal",
    "text": "Pensando no melhor cenário possível, qual seria o resultado ideal dessa entrega?",
    "next": "obj_sucesso"
  },
  {
    "id": "obj_sucesso",
    "text": "Como vocês saberão que a solução deu certo? Há algum indicador ou métrica de sucesso que faça sentido acompanhar?",
    "next": "obj_beneficio"
  },
  {
    "id": "obj_beneficio",
    "text": "Qual é o principal benefício esperado dessa solução? (ex.: agilidade, redução de custo, visibilidade, controle)",
    "next": "gate_processo"
  },
  {
    "id": "gate_processo",
    "text": "Você gostaria de detalhar um pouco como esse processo funciona hoje na prática? (responda 'sim' ou 'nao')",
    "branches": {
      "sim": "proc_fluxo",
      "nao": "usuarios_quem",
      "default": "usuarios_quem"
    },
    "next": "usuarios_quem"
  },
  {
    "id": "proc_fluxo",
    "text": "Como esse processo funciona hoje na prática, passo a passo?",
    "next": "proc_ferramentas"
  },
  {
    "id": "proc_ferramentas",
    "text": "Quais sistemas, planilhas ou ferramentas vocês usam hoje para executar esse processo?",
    "next": "proc_gargalos"
  },
  {
    "id": "proc_gargalos",
    "text": "Onde você enxerga hoje os maiores gargalos, retrabalhos ou chances de erro nesse processo?",
    "next": "proc_integracoes"
  },
  {
    "id": "proc_integracoes",
    "text": "Esse processo depende de outros sistemas ou integrações? Se sim, quais?",
    "next": "usuarios_quem"
  },
  {
    "id": "usuarios_quem",
    "text": "Quem usará essa solução no dia a dia?",
    "next": "usuarios_perfis"
  },
  {
    "id": "usuarios_perfis",
    "text": "Existem perfis diferentes de usuários? (ex.: operador, gestor, cliente, fornecedor)",
    "next": "usuarios_decisores"
  },
  {
    "id": "usuarios_decisores",
    "text": "Quem normalmente toma a decisão final sobre aprovações ou priorizações relacionadas a esse processo?",
    "next": "gate_qualidade"
  },
  {
    "id": "gate_qualidade",
    "text": "Você gostaria de registrar algum ponto sobre desempenho, segurança, LGPD ou restrições técnicas que essa solução precisa respeitar? (responda 'sim' ou 'nao')",
    "branches": {
      "sim": "qualidade_req",
      "nao": "req_geral",
      "default": "req_geral"
    },
    "next": "req_geral"
  },
  {
    "id": "qualidade_req",
    "text": "Quais preocupações você tem em relação a desempenho, segurança, LGPD ou disponibilidade dessa solução?",
    "next": "req_geral"
  },
  {
    "id": "req_geral",
    "text": "Pensando na solução ideal, o que você imagina que essa funcionalidade precisa fazer no dia a dia?",
    "next": "req_obrigatorios"
  },
  {
    "id": "req_obrigatorios",
    "text": "Existem requisitos obrigatórios ou regras de negócio que precisam ser respeitadas? (ex.: validações, limites, aprovações obrigatórias)",
    "next": "req_naopode"
  },
  {
    "id": "req_naopode",
    "text": "Há algo que 'não pode acontecer de jeito nenhum' com essa solução?",
    "next": "req_referencia"
  },
  {
    "id": "req_referencia",
    "text": "Existe alguma referência (tela, planilha, sistema) que se pareça com o que vocês esperam?",
    "next": "gate_mvp"
  },
  {
    "id": "gate_mvp",
    "text": "Você gostaria de priorizar o que é essencial para uma primeira versão (MVP)? (responda 'sim' ou 'nao')",
    "branches": {
      "sim": "mvp_essencial",
      "nao": "prio_nivel",
      "default": "prio_nivel"
    },
    "next": "prio_nivel"
  },
  {
    "id": "mvp_essencial",
    "text": "Pensando em uma primeira versão (MVP), o que é essencial estar incluído para já gerar valor?",
    "next": "mvp_posterior"
  },
  {
    "id": "mvp_posterior",
    "text": "E o que poderia ficar para versões futuras, caso seja necessário fatiar a entrega?",
    "next": "prio_nivel"
  },
  {
    "id": "prio_nivel",
    "text": "Qual é a prioridade dessa demanda em relação às demais iniciativas em andamento?",
    "next": "prazo_critico"
  },
  {
    "id": "prazo_critico",
    "text": "Existe alguma data crítica ou evento importante relacionado a essa demanda? (ex.: auditoria, fechamento, contrato)",
    "next": "contato_ponto_focal"
  },
  {
    "id": "contato_ponto_focal",
    "text": "Quem será o ponto focal de contato para dúvidas e validações ao longo do desenvolvimento?",
    "next": "contato_formato"
  },
  {
    "id": "contato_formato",
    "text": "Qual é o melhor formato de acompanhamento para vocês? (ex.: e-mail, reuniões periódicas, protótipos)",
    "next": "contato_validacao"
  },
  {
    "id": "contato_validacao",
    "text": "Como vocês preferem validar a solução antes de ir para produção? (ex.: mockups, ambiente de teste, walkthrough)",
    "next": "extra_info"
  },
  {
    "id": "extra_info",
    "text": "Há alguma outra informação que você considera importante registrar sobre essa demanda e que ainda não foi comentada?",
    "next": "fim"
  },
  {
    "id": "fim",
    "text": "Obrigado! Encerramos a entrevista inicial. Em seguida, vou gerar a ATA com o resumo do que conversamos.",
    "next": null
  }
]
